/* 
   MadridRegistration.strings
   Conference

   Created by Josh Converse on 2011/01/26.
   Copyright 2011 Apple. All rights reserved.
*/

// This string is defined as part of the Conference framework as well
"FACETIME" = "iMessage";

// Generic
"FACETIME_ALERT_OK" = "OK";
"FACETIME_ALERT_CANCEL" = "Cancel";
"LOADING" = "Loading…";
"SIGNING_IN" = "Signing in…";
"VERIFYING" = "Verifying";
"NEXT" = "Next";
"ERROR" = "Error";
"LEARN_MORE" = "Learn More";

/*
 Account Alias Summary
 
 These strings are used when attempting to show a summary of the useable account
 aliases.
*/
"ALIAS_SUMMARY_0_0" = "No Addresses";
"ALIAS_SUMMARY_0_N" = "%@ Email Addresses"; // Value comes from NSNumberFormatter
"ALIAS_SUMMARY_1_N" = "%@ Addresses"; // Value comes from NSNumberFormatter

// No Account / Alias
/* Filler text if there is no account or alias available */
"FACETIME_ACCOUNT_INFO_UNAVAILABLE" = "Use your Apple ID for iMessage";
"FACETIME_ALIAS_INFO_UNAVAILABLE" = "N/A"; // Nobody should see this string

// Generic Server Errors
"FACETIME_ACTIVATION_ERROR_TITLE" = "iMessage Activation";
"FACETIME_ACTIVATION_ERROR_GENERIC" = "Unable to contact the iMessage server. Try again.";

// Splash Page
"FACETIME_SPLASH_SYNOPSIS" = "iMessages can be sent between iPhone, iPad and iPod touch.";
"FACETIME_SPLASH_LEARN_MORE" = "Learn more about iMessage";
"FACETIME_SPLASH_LEARN_MORE_URL_iphone" = "http://www.apple.com/iphone/built-in-apps/messages.html";
"FACETIME_SPLASH_LEARN_MORE_URL_ipod" = "http://www.apple.com/ipodtouch/built-in-apps/messages.html";
"FACETIME_SPLASH_LEARN_MORE_URL_ipad" = "http://www.apple.com/ipad/built-in-apps/messages.html";
"FACETIME_SPLASH_GET_STARTED" = "Get Started";

/*
  Sign in page

  This is the first page in the first-time account setup flow. The user enters
  their AppleID and password, and if their credentials are right, they will
  proceed to the next stage in the setup flow
*/
"FACETIME_SIGNIN_TITLE" = "Enter Apple ID";
// This is the normal sign-in description text
"FACETIME_SIGNIN_DESCRIPTION_iphone" = "Sign in with your Apple ID to activate iMessage.";
"FACETIME_SIGNIN_DESCRIPTION_ipad" = "Sign in with your Apple ID to activate iMessage.";
/* If the user was forcibly signed out of FaceTime by the server, we'll display
this instead of FACETIME_SIGNIN_DESCRIPTION */
"FACETIME_SIGNIN_LOGIN_FAILED_DESCRIPTION" = "You were signed out of iMessage because your Apple ID or password changed. Sign in to turn on iMessage.";
/* Placeholder text for the username field */
"FACETIME_USERNAME_LABEL" = "name@example.com";
/* Placeholder text for the password field */
"FACETIME_PASSWORD_LABEL" = "password";
/* Text on the sign in button */
"FACETIME_SIGNIN_BUTTON_LABEL" = "Sign In";
/* Text on the create new account button */
"FACETIME_SIGNIN_CREATE_ACCOUNT_BUTTON_LABEL" = "Create New Account";
/* These are the errors that may be returned from the server as a result of
signing in. FACETIME_SIGNIN_ERROR_GENERIC is the catch-all */
"FACETIME_SIGNIN_ERROR_GENERIC" = "An error occurred during activation. Try again.";
"FACETIME_SIGNIN_ERROR_BLANK_USERNAME" = "Please enter a valid user name.";
"FACETIME_SIGNIN_ERROR_INVALID_CREDENTIALS" = "The user name or password for “%@” was incorrect. Try again.";
"FACETIME_SIGNIN_ERROR_NEW_PASSWORD_NEEDED" = "The password for this Apple ID needs to be updated.";
"FACETIME_SIGNIN_ERROR_ACCOUNT_NOT_AUTHORIZED" = "The provided Apple ID needs some additional information in order to proceed.";
"FACETIME_SIGNIN_ERROR_TIMEOUT" = "Could not sign in. Please check your network connection and try again.";
"FACETIME_SIGNIN_ERROR_COULDNT_LAUNCH_MAIL" = "Could not launch Mail.";

// Email validation page
"FACETIME_EMAIL_TITLE" = "iMessage";
"FACETIME_EMAIL_DESCRIPTION_iphone" = "People will message you using your email address. What email address would you like to use?";
"FACETIME_EMAIL_DESCRIPTION_ipad" = "People will message you using your email address. What email address would you like to use?";
"FACETIME_EMAIL_ADDRESS_LABEL" = "Address";
"FACETIME_EMAIL_ADDRESS_PLACEHOLDER" = "Email Address";
"FACETIME_EMAIL_VALIDATE_LABEL" = "Verify Email Address";
"FACETIME_EMAIL_CHECK_MAIL_LABEL" = "Check Mail";
"FACETIME_EMAIL_CHECK_MAIL_DESCRIPTION" = "Unable to verify address. An email with a verification link has been sent to the above email address.";
"FACETIME_EMAIL_ERROR_GENERIC" = "An error occurred while verifying your email";
"FACETIME_EMAIL_ERROR_IN_USE" = "Unable to verify email because it is already in use.";
"FACETIME_EMAIL_ERROR_NOT_AVAILABLE" = "This email address cannot be used for iMessage.";

/* This message is a worst-case everything-failed message. Users should never see it, but if they do, we're at a point where things are seriously broken on their device */
"FACETIME_EMAIL_UNABLE_TO_ADD_ALIAS" = "Unable to add the email address “%@”.";

// Alias detail page
/* Title at the top of the alias detail page */
"FACETIME_ALIAS_TITLE" = "Email";
"FACETIME_ALIAS_DELETE_CONFIRMATION_MESSAGE" = "You will no longer be able to receive iMessages at %@.";
"FACETIME_ALIAS_DELETE_CONFIRMATION_BUTTON" = "Remove Email Address";
"FACETIME_RESEND_VALIDATION_EMAIL" = "Resend Validation Email";
"FACETIME_REMOVE_ALIAS" = "Remove This Email";

/*
  Server driven account pages

  These are the server-driven account pages used for various portions of the
  signup process. At the moment, they include
    * Creating a new account
    * Changing the password on an account
    * Editing an account's information
    * Re-authorizing an account (giving us permission, tos's, etc)
*/
// This is shown in the navigation bar before the server dictates a new string for us
"FACETIME_ACCOUNT_PAGE_TITLE" = "Account";

/*
 Settings Screen
 
 This is the overall configuration screen for FaceTime. You can turn on/off the
 service, add/remove email addresses, and configure Caller ID settings.
 */

/* Privacy disclaimer. Shown underneath the FaceTime on/off switch */
"FACETIME_SWITCH_STATUS_DEFAULT" = "iMessages can be sent between iPhone,\niPad and iPod touch."; /* Break added for english to not orphan 'touch' */
"FACETIME_SWITCH_STATUS_IN_PROGRESS" = "Waiting for activation…";
"FACETIME_SWITCH_STATUS_FAILED" = "Activation unsuccessful.\nTurn on iMessage to try again.";

"SETTINGS_CALL_GROUP_LABEL" = "Caller ID";
"FACETIME_SETTINGS_CALLER_ID_LABEL" = "Caller ID";
"FACETIME_SETTINGS_ACCOUNT_LABEL" = "Apple ID:";
"FACETIME_SETTINGS_ADD_ANOTHER_EMAIL" = "Add Another Email…";
"FACETIME_SETTINGS_ADD_AN_EMAIL" = "Add An Email…";
"FACETIME_SETTINGS_EMAIL_INPUT_LABEL" = "Email";

"FACETIME_SETTINGS_ALIAS_LABEL_iphone" = "You can be reached for\nmessages at:";
"FACETIME_SETTINGS_ALIAS_LABEL_ipad" = "You can be reached for messages at:";
    // These are the labels for the various states on the left hand side of each email.
    "FACETIME_ALIAS_STATUS_DEFAULT" = "Unknown";
    "FACETIME_ALIAS_STATUS_FAILURE" = "Error";
    "FACETIME_ALIAS_STATUS_VALIDATING" = "Verifying";
    "FACETIME_EMAIL_ALIAS_STATUS_VALIDATED" = "Email";
    "FACETIME_PHONE_ALIAS_STATUS_VALIDATED" = "Phone";

/*
  Account Popup
  
  This is the popup that appears when a user on the settings page taps the
  account button. It provides a list of a few options the user can take that are
  account specific
*/
"FACETIME_ACCOUNT_POPUP_TITLE" = "iMessage Account";
"FACETIME_ACCOUNT_POPUP_EDIT_LOCATION" = "Change Location";
"FACETIME_ACCOUNT_POPUP_VIEW_ACCOUNT" = "View Account";
"FACETIME_ACCOUNT_POPUP_SIGN_OUT" = "Sign Out";

// Forgot Password Popup
"FACETIME_FORGOT_PASSWORD_ALERT_TITLE" = "Apple ID Password";
"FACETIME_FORGOT_PASSWORD_ALERT_MESSAGE" = "Your password was entered incorrectly too many times.";
"FACETIME_FORGOT_PASSWORD_ALERT_OK" = "Get Password";

/*
  Locale Entry
  
  This is the page where the user must choose a country/region and possibly
  enter a phone number if the region isn't enough to auto-guess a phone number.
  The phone number field won't appear until a region has been chosen, and then
  only if the region doesn't have sufficient phone number information.
*/
"FACETIME_LOCALE_COUNTRY_SELECT_LABEL" = "Region";
"FACETIME_LOCALE_DESCRIPTION_TITLE" = "Location";
"FACETIME_LOCALE_DESCRIPTION" = "Choose a country or region to allow iMessage to message local numbers in your address book.";
"FACETIME_LOCALE_PHONE_FIELD_LABEL" = "Phone";
"FACETIME_LOCALE_PHONE_FIELD_DESCRIPTION" = "Please provide a sample phone number for this region.";
"FACETIME_LOCALE_MISSING_REGION_ALERT_MESSAGE" = "Please select a region.";
// This is the common-case error for the server saying "your region + phone combination was no good"
"FACETIME_LOCALE_ERROR_INVALID_PROFILE" = "This region and phone number combination cannot be used.";

/*
  Network Alerts

  These strings are used for showing network-centric alerts, primarily to prompt
  the user to enable networking.
*/
"FACETIME_NETWORK_ERROR_TITLE" = "iMessage Unavailable";
"FACETIME_NETWORK_SETTINGS_BUTTON" = "Settings";
// Wi-Fi only devices
"FACETIME_NETWORK_ERROR_WIFI" = "Turn on Wi-Fi to set up iMessage.";
"FACETIME_NETWORK_ERROR_WLAN" = "Turn on WLAN to set up iMessage.";
// Cellular devices
"FACETIME_NETWORK_ERROR_CELL" = "Turn on mobile data or use Wi-Fi to set up iMessage.";
"FACETIME_NETWORK_ERROR_CELL_WLAN" = "Turn on mobile data or use WLAN to set up iMessage.";
"FACETIME_NETWORK_ERROR_CELL_NO_WIFI" = "Turn on mobile data to set up iMessage.";
// Roaming cellular devices
"FACETIME_NETWORK_ERROR_ROAM" = "Use Wi-Fi or enable data roaming to set up iMessage. Additional fees may apply.";
"FACETIME_NETWORK_ERROR_ROAM_WLAN" = "Use WLAN or enable data roaming to set up iMessage. Additional fees may apply.";
"FACETIME_NETWORK_ERROR_ROAM_NO_WIFI" = "Enable data roaming to set up iMessage. Additional fees may apply.";

// "Facetime is disabled" Page
"FACETIME_DISABLED_DESCRIPTION_TITLE" = "iMessage Settings";
"FACETIME_DISABLED_DESCRIPTION" = "You have iMessage turned off in Settings. Would you like to turn it back on?";
"FACETIME_DISABLED_TURN_ON_LABEL" = "Turn iMessage On";
